; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-3-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	p2-3 - location
	p3-0 - location
	p3-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s0)
	(at driver5 s3)
	(at driver6 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at package1 s1)
	(at package2 s3)
	(at package3 s3)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s3)
	(at package8 s3)
	(at package9 s3)
	(at package10 s0)
	(at package11 s1)
	(at package12 s1)
	(at package13 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s3 s2)
	(link s2 s3)
)
	(:goal (and
	(at driver3 s2)
	(at driver4 s2)
	(at driver5 s2)
	(at driver6 s2)
	(at truck2 s3)
	(at package1 s0)
	(at package2 s1)
	(at package4 s0)
	(at package5 s1)
	(at package6 s0)
	(at package7 s2)
	(at package8 s0)
	(at package9 s1)
	(at package10 s2)
	(at package11 s0)
	(at package12 s0)
	(at package13 s0)
	))


)

; plan
1. (board-truck driver3 s2 truck1)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 17
2. (drive-truck driver3 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 1 of 17
3. (load-truck s3 package9 truck1)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   goals met: 1 of 17
4. (drive-truck driver3 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 1 of 17
5. (unload-truck s1 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 2 of 17
6. (load-truck s1 package6 truck1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 2 of 17
7. (load-truck s1 package12 truck1)
   deleted: (at package12 s1)
   added: (in package12 truck1)
   goals met: 2 of 17
8. (load-truck s1 package11 truck1)
   deleted: (at package11 s1)
   added: (in package11 truck1)
   goals met: 2 of 17
9. (drive-truck driver3 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 2 of 17
10. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 2 of 17
11. (drive-truck driver3 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 2 of 17
12. (unload-truck s1 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 3 of 17
13. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 3 of 17
14. (drive-truck driver3 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 3 of 17
15. (unload-truck s0 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   goals met: 4 of 17
16. (drive-truck driver3 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 4 of 17
17. (board-truck driver6 s1 truck2)
   deleted: (at driver6 s1) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 4 of 17
18. (drive-truck driver3 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 4 of 17
19. (unload-truck s0 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s0)
   goals met: 5 of 17
20. (unload-truck s0 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s0)
   goals met: 6 of 17
21. (load-truck s0 package10 truck1)
   deleted: (at package10 s0)
   added: (in package10 truck1)
   goals met: 6 of 17
22. (drive-truck driver3 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 6 of 17
23. (drive-truck driver3 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 6 of 17
24. (load-truck s3 package8 truck1)
   deleted: (at package8 s3)
   added: (in package8 truck1)
   goals met: 6 of 17
25. (drive-truck driver3 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 6 of 17
26. (unload-truck s2 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s2)
   goals met: 7 of 17
27. (drive-truck driver3 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 7 of 17
28. (unload-truck s0 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 8 of 17
29. (unload-truck s0 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 9 of 17
30. (drive-truck driver3 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 9 of 17
31. (disembark-truck driver3 s2 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 10 of 17
32. (walk driver4 s0 p2-0)
   deleted: (at driver4 s0)
   added: (at driver4 p2-0)
   goals met: 10 of 17
33. (walk driver4 p2-0 s2)
   deleted: (at driver4 p2-0)
   added: (at driver4 s2)
   goals met: 11 of 17
34. (walk driver5 s3 p2-3)
   deleted: (at driver5 s3)
   added: (at driver5 p2-3)
   goals met: 11 of 17
35. (walk driver5 p2-3 s2)
   deleted: (at driver5 p2-3)
   added: (at driver5 s2)
   goals met: 12 of 17
36. (drive-truck driver6 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 12 of 17
37. (drive-truck driver6 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 13 of 17
38. (load-truck s3 package7 truck2)
   deleted: (at package7 s3)
   added: (in package7 truck2)
   goals met: 13 of 17
39. (load-truck s3 package2 truck2)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   goals met: 13 of 17
40. (load-truck s3 package13 truck2)
   deleted: (at package13 s3)
   added: (in package13 truck2)
   goals met: 13 of 17
41. (drive-truck driver6 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 12 of 17
42. (drive-truck driver6 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 12 of 17
43. (unload-truck s2 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s2)
   goals met: 13 of 17
44. (drive-truck driver6 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 13 of 17
45. (unload-truck s1 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   goals met: 14 of 17
46. (drive-truck driver6 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 14 of 17
47. (unload-truck s0 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s0)
   goals met: 15 of 17
48. (drive-truck driver6 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 15 of 17
49. (drive-truck driver6 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 16 of 17
50. (disembark-truck driver6 s3 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s3) (empty truck2)
   goals met: 16 of 17
51. (walk driver6 s3 p2-3)
   deleted: (at driver6 s3)
   added: (at driver6 p2-3)
   goals met: 16 of 17
52. (walk driver6 p2-3 s2)
   deleted: (at driver6 p2-3)
   added: (at driver6 s2)
   goals met: 17 of 17
